from Algorithms.Bat import Bat
from Algorithms.Cuckoo import Cuckoo

import numpy as np
import numba as nb

import matplotlib.pyplot as plt


# 2. (3 бали) Розробити програмне забезпечення (мова програмування і середовище
# розробки за вибором студента) для тестування знаходження глобального
# екстремуму функцій з четвертого розділу роботи (для функції Растринга
# взяти n = 20). Протестувати кожен з розглянутих методів на даних функціях.
# Подати результати тестування у вигляді графіків, як у попередніх роботах.
# Кількість запусків програмного застосунку) для 3-х алгоритмів будь-яке (на
# вибір студента).

# --------------------------------------- #
# @nb.jit()
def Rastrigin(X):
    A = 10
    length = len(X)
    result = A*length
    for x in X:
        result += x**2-A*np.cos(2*np.pi*x)
    return result


Rastrigin_limits = [[-5.12, 5.12]]


# --------------------------------------- #
# @nb.jit()
def Mishri_Berda(X):
    x, y, = X
    f1 = (x+5)**2+(y+5)**2 < 25
    if f1:
        return np.exp((1-np.cos(x))**2)*np.sin(y) + np.exp((1-np.sin(y))**2)*np.cos(x) + (x-y)**2
    else:
        return float('inf')


Mishri_Berda_limits = [[-10, 0], [-6.5, 0]]

# --------------------------------------- #

ite = 3
iterat = 1000
pop = 200
bat = []
for i in range(ite):
    bat.append(Bat(pop, iterat, .9, 1.9, .9, .5, .9, [.1, .3], [0, 1], Rastrigin, Rastrigin_limits*20, history=True, d2=True, show=False, random=True, fps=20).run()[0])  #, save="Lab3/Images/Rastrigin.gif"
plt.plot(range(iterat), np.mean(bat, axis=0), label="Bat")
cuckoo = []
for i in range(ite):
    cuckoo.append(Cuckoo(pop, iterat, .9, 100, 100, [0, 1], Rastrigin, Rastrigin_limits*20, history=True, d2=True, show=False, random=True, fps=20).run()[0])  #, save="Lab3/Images/Rastrigin.gif"
plt.plot(range(iterat), np.mean(cuckoo, axis=0), label="Cuckoo")
plt.legend()
plt.grid()
plt.show()

# 3. (3 бали) Модифікувати відповідні програми для знаходження розв’язку будь-
# якої задачі з підрозділу 5.1. Показати динаміку збіжності обраного методу на
# обраній задачі, навести графічно відповідний розв’язок задач та числові
# параметри, які демонструють достатню збіжність методу на задачі. У якості
# цільової функції взяти:
#     a) f(α) = |x(t = b; α) − B|;
#     b) f(α) = (x(t = b; α) − B)**2,
#       де b – значення аргументу на границі, B – потрібне значення функції
#       на границі t = b для деякого значення α.
# Оцінити графічно, наскільки ефективно працюють методи для різних
# цільових функцій.


# --------------------------------------- #
def F511(X):
    pass
    # x'' + y'**2 * np.cos(x') = x**2 * t**2
    # y' = y**4 + x**3 - 3 * np.sin(t * x')
    # x'(1) = 1, x(3) = 2, y(1) = 1, t = [1, 3]


F511_limits = [[-3, 3]]


# --------------------------------------- #
def F512(X):
    pass
    # x' - y'**2 * np.cos(2*t + x) = 5*x**2 - 25*t**2
    # y'' = 4/(1 + y**2 * x**2) + 4 * np.sin(t * x')
    # x(1) = 2, y(1) = 2, y'(3) = 0, t = [1, 3]


F512_limits = [[-3, 3]]


# --------------------------------------- #
def F513(X):
    pass
    # x' = 2*x**2 - 25*t**2 - np.sin(x * y * t)
    # y'' = 1 - 4 * np.cos(x' * t)
    # x(1) = 2, y(1) = 1, y'(3) = -1, t = [1, 3]


F513_limits = [[-3, 3]]


# --------------------------------------- #

# 4. (2 додаткові бали) Модифікувати відповідні програмі для знаходження розв’язку
# будь-якої задачі з підрозділу 5.2. Показати динаміку збіжності обраного
# методу на обраній задачі, навести графічно відповідний розв’язок задач та
# числові параметри, які демонструють достатню збіжність методу на задачі. У
# якості цільової функції взяти:
#     a) f(α; β) = m|x(b; α; β) − A| + n|y(b; α; β) − B|;
#     b) f(α; β) = m(x(b; α; β) − A)**2 + n(y(b; α; β) − B)**2,
#       де b – значення аргументу на границі; A – потрібне значення функції
#       на границі t = b функції x(t) для пари (α; β); B – потрібне значення
#       функції на границі t = b функції y(t) для пари (α; β); m ∈ R+, n ∈ R+.
#     c) f(α; β) = max(m|x(b; α; β) − A|; n|y(b; α; β) − B|),
#     де b – значення аргументу на границі; A – потрібне значення функції
#     на границі t = b функції x(t) для пари (α; β); B – потрібне значення
#     функції на границі t = b функції y(t) для пари (α; β); m ∈ R+, n ∈ R+.

# 5. Оцінити графічно, наскільки ефективно працюють методи для різних
# цільових функцій.
